mygamelife/SWD-for-ARM-Cortex-M4/FlashProgrammer/build/test/mocks/mock_stm32f4xx_hal_flash.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_STM32F4XX_HAL_FLASH_H
#define _MOCK_STM32F4XX_HAL_FLASH_H

#include "stm32f4xx_hal_flash.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC)
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

void mock_stm32f4xx_hal_flash_Init(void);
void mock_stm32f4xx_hal_flash_Destroy(void);
void mock_stm32f4xx_hal_flash_Verify(void);




#define HAL_FLASH_Program_IgnoreAndReturn(cmock_retval) HAL_FLASH_Program_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Program_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_Program_ExpectAndReturn(TypeProgram, Address, Data, cmock_retval) HAL_FLASH_Program_CMockExpectAndReturn(__LINE__, TypeProgram, Address, Data, cmock_retval)
void HAL_FLASH_Program_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t TypeProgram, uint32_t Address, uint64_t Data, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_Program_CALLBACK)(uint32_t TypeProgram, uint32_t Address, uint64_t Data, int cmock_num_calls);
void HAL_FLASH_Program_StubWithCallback(CMOCK_HAL_FLASH_Program_CALLBACK Callback);
#define HAL_FLASH_Program_IT_IgnoreAndReturn(cmock_retval) HAL_FLASH_Program_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Program_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_Program_IT_ExpectAndReturn(TypeProgram, Address, Data, cmock_retval) HAL_FLASH_Program_IT_CMockExpectAndReturn(__LINE__, TypeProgram, Address, Data, cmock_retval)
void HAL_FLASH_Program_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t TypeProgram, uint32_t Address, uint64_t Data, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_Program_IT_CALLBACK)(uint32_t TypeProgram, uint32_t Address, uint64_t Data, int cmock_num_calls);
void HAL_FLASH_Program_IT_StubWithCallback(CMOCK_HAL_FLASH_Program_IT_CALLBACK Callback);
#define HAL_FLASH_IRQHandler_Ignore() HAL_FLASH_IRQHandler_CMockIgnore()
void HAL_FLASH_IRQHandler_CMockIgnore(void);
#define HAL_FLASH_IRQHandler_Expect() HAL_FLASH_IRQHandler_CMockExpect(__LINE__)
void HAL_FLASH_IRQHandler_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_FLASH_IRQHandler_CALLBACK)(int cmock_num_calls);
void HAL_FLASH_IRQHandler_StubWithCallback(CMOCK_HAL_FLASH_IRQHandler_CALLBACK Callback);
#define HAL_FLASH_EndOfOperationCallback_Ignore() HAL_FLASH_EndOfOperationCallback_CMockIgnore()
void HAL_FLASH_EndOfOperationCallback_CMockIgnore(void);
#define HAL_FLASH_EndOfOperationCallback_Expect(ReturnValue) HAL_FLASH_EndOfOperationCallback_CMockExpect(__LINE__, ReturnValue)
void HAL_FLASH_EndOfOperationCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, uint32_t ReturnValue);
typedef void (* CMOCK_HAL_FLASH_EndOfOperationCallback_CALLBACK)(uint32_t ReturnValue, int cmock_num_calls);
void HAL_FLASH_EndOfOperationCallback_StubWithCallback(CMOCK_HAL_FLASH_EndOfOperationCallback_CALLBACK Callback);
#define HAL_FLASH_OperationErrorCallback_Ignore() HAL_FLASH_OperationErrorCallback_CMockIgnore()
void HAL_FLASH_OperationErrorCallback_CMockIgnore(void);
#define HAL_FLASH_OperationErrorCallback_Expect(ReturnValue) HAL_FLASH_OperationErrorCallback_CMockExpect(__LINE__, ReturnValue)
void HAL_FLASH_OperationErrorCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, uint32_t ReturnValue);
typedef void (* CMOCK_HAL_FLASH_OperationErrorCallback_CALLBACK)(uint32_t ReturnValue, int cmock_num_calls);
void HAL_FLASH_OperationErrorCallback_StubWithCallback(CMOCK_HAL_FLASH_OperationErrorCallback_CALLBACK Callback);
#define HAL_FLASH_Unlock_IgnoreAndReturn(cmock_retval) HAL_FLASH_Unlock_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Unlock_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_Unlock_ExpectAndReturn(cmock_retval) HAL_FLASH_Unlock_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Unlock_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_Unlock_CALLBACK)(int cmock_num_calls);
void HAL_FLASH_Unlock_StubWithCallback(CMOCK_HAL_FLASH_Unlock_CALLBACK Callback);
#define HAL_FLASH_Lock_IgnoreAndReturn(cmock_retval) HAL_FLASH_Lock_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Lock_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_Lock_ExpectAndReturn(cmock_retval) HAL_FLASH_Lock_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Lock_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_Lock_CALLBACK)(int cmock_num_calls);
void HAL_FLASH_Lock_StubWithCallback(CMOCK_HAL_FLASH_Lock_CALLBACK Callback);
#define HAL_FLASH_OB_Unlock_IgnoreAndReturn(cmock_retval) HAL_FLASH_OB_Unlock_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_OB_Unlock_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_OB_Unlock_ExpectAndReturn(cmock_retval) HAL_FLASH_OB_Unlock_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_OB_Unlock_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_OB_Unlock_CALLBACK)(int cmock_num_calls);
void HAL_FLASH_OB_Unlock_StubWithCallback(CMOCK_HAL_FLASH_OB_Unlock_CALLBACK Callback);
#define HAL_FLASH_OB_Lock_IgnoreAndReturn(cmock_retval) HAL_FLASH_OB_Lock_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_OB_Lock_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_OB_Lock_ExpectAndReturn(cmock_retval) HAL_FLASH_OB_Lock_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_OB_Lock_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_OB_Lock_CALLBACK)(int cmock_num_calls);
void HAL_FLASH_OB_Lock_StubWithCallback(CMOCK_HAL_FLASH_OB_Lock_CALLBACK Callback);
#define HAL_FLASH_OB_Launch_IgnoreAndReturn(cmock_retval) HAL_FLASH_OB_Launch_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_OB_Launch_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_OB_Launch_ExpectAndReturn(cmock_retval) HAL_FLASH_OB_Launch_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_OB_Launch_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_OB_Launch_CALLBACK)(int cmock_num_calls);
void HAL_FLASH_OB_Launch_StubWithCallback(CMOCK_HAL_FLASH_OB_Launch_CALLBACK Callback);
#define HAL_FLASH_GetError_IgnoreAndReturn(cmock_retval) HAL_FLASH_GetError_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_GetError_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_FLASH_GetError_ExpectAndReturn(cmock_retval) HAL_FLASH_GetError_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_GetError_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
typedef uint32_t (* CMOCK_HAL_FLASH_GetError_CALLBACK)(int cmock_num_calls);
void HAL_FLASH_GetError_StubWithCallback(CMOCK_HAL_FLASH_GetError_CALLBACK Callback);
#define FLASH_WaitForLastOperation_IgnoreAndReturn(cmock_retval) FLASH_WaitForLastOperation_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void FLASH_WaitForLastOperation_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define FLASH_WaitForLastOperation_ExpectAndReturn(Timeout, cmock_retval) FLASH_WaitForLastOperation_CMockExpectAndReturn(__LINE__, Timeout, cmock_retval)
void FLASH_WaitForLastOperation_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t Timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_FLASH_WaitForLastOperation_CALLBACK)(uint32_t Timeout, int cmock_num_calls);
void FLASH_WaitForLastOperation_StubWithCallback(CMOCK_FLASH_WaitForLastOperation_CALLBACK Callback);

#endif
